import React from 'react'
import Header from '../../Header/Header'
import './Terms.scss'

const Terms = () => {
  return (
    <div className='Terms'>
      <Header />
      <section className='Terms-inner'>
        <h1 style={{paddingBottom:"50px"}}>Угода про конфіденційність</h1>
        <p><strong>CASE MANAGER PRO</strong> розуміє важливість забезпечення конфіденційності й недоторканності Персональних даних фізичних осіб, а також Інформаційних матеріалів, що знаходяться в облікових записах Користувача, тому укладає із Вами (далі «Користувач») дану Угоду про конфіденційність (далі «Угода») для визначення порядку одержання, зберігання, обробки, використання й розкриття <strong>CASE MANAGER PRO</strong> Персональних та інших даних Користувача при використанні Користувачем послуг <strong>CASE MANAGER PRO</strong> та Інтернет-сайту <a href="https://case-m.pro" target="_blank">https://case-m.pro</a> (далі «Сайт»).</p>

        <p>Для того, щоб користуватися Сайтом, Послугами й Сервісами, Користувач зобов’язаний надати свою згоду з умовами цієї Угоди. Користувач не має права використовувати Сайт і послуги, якщо він не згодний з умовами Угоди.</p>

        <p>Користувач не має права використовувати Сайт, Послуги й Сервіси й не може прийняти умови Угоди, якщо він не досяг встановленого законом віку, коли він має право укладати такі угоди з <strong>CASE MANAGER PRO</strong>.</p>

        <h2>ТЕРМІНИ</h2>
        <ul>
          <li><strong>Персональні дані</strong> — інформація, яка відноситься до певного Користувача та яка дозволяє ідентифікувати цього Користувача як особистість.</li>
          <li><strong>Загальнодоступні дані</strong> — дані (у тому числі Персональні дані), до яких фізична особа — власник цих даних, надала доступ необмеженому колу осіб (у т.ч. шляхом публікації на будь-якому інтернет-сайті без обмеження доступу до цих даних) або на які згідно з даною Угодою й/або чинного законодавства не поширюється вимога дотримання конфіденційності.</li>
          <li><strong>Обліковий запис</strong> — запис, який містить дані авторизації Користувача (логін і пароль), необхідні для ідентифікації Користувача при використанні ним Сайту й Послуг.</li>
          <li><strong>Cookie</strong> — фрагмент даних, що не містить Персональних даних, створений Сайтом і збережений у комп’ютері Користувача у вигляді одного або декількох файлів. Cookie не містять Персональних даних і можуть бути заблоковані Користувачем у будь-який момент. Блокування Cookie Користувачем може привести до скрутного використання Сайту та Послуг або до повної неможливості їх використання.</li>
          <li><strong>Інформаційні матеріали</strong> — будь-які текстові, графічні, аудіо-, відео, та змішані матеріали інформаційного характеру.</li>
        </ul>

        <h2>1. ПРЕДМЕТ УГОДИ</h2>
        <ol>
          <li>Дана Угода визначає порядок одержання, зберігання, обробки, використання й розкриття Персональних і інших даних (у т.ч. Інформаційних матеріалів), які надаються та розміщуються Користувачем при використанні ним Сайту й Послуг.</li>
          <li>Використовуючи будь-яку частину Сайту й/або Послуги, Користувач надає <strong>CASE MANAGER PRO</strong> право одержувати, зберігати, обробляти, використовувати Персональні дані та Інформаційні матеріали Користувача на умовах даної Угоди.</li>
          <li>Дана Угода не регулює й <strong>CASE MANAGER PRO</strong> не несе відповідальності за порядок одержання, зберігання, обробки, використання й розкриття Персональних даних і Інформаційних матеріалів Користувача сторонніми підприємствами й організаціями, які не перебувають у володінні або під керуванням <strong>CASE MANAGER PRO</strong>, і фізичними особами, які не є працівниками <strong>CASE MANAGER PRO</strong>, навіть якщо Користувач одержав доступ до сайтів, ПО, товарів або послуг цих осіб за допомогою Сайту.</li>
          <li>Метою одержання, зберігання, обробки й використання Персональних, Загальнодоступних і інших даних Користувача є захист інтересів Користувача та <strong>CASE MANAGER PRO</strong>, а також надання Користувачеві послуг, включаючи показ персоналізованої або загальної інформації, поліпшення якості існуючих послуг, які надаються <strong>CASE MANAGER PRO</strong>.</li>
        </ol>

        <h2>2. ОДЕРЖАННЯ, ОБРОБКА Й ВИКОРИСТАННЯ ІНФОРМАЦІЇ</h2>
        <ol>
          <li>При створенні Облікового запису Користувач повинен вказати Дані авторизації, а також ім’я, прізвище, адресу електронної пошти й інші дані. Після створення й використання Користувачем Облікового запису, <strong>CASE MANAGER PRO</strong> одержує можливість ідентифікувати Користувача при кожному використанні ним Сайту.</li>
          <li><strong>CASE MANAGER PRO</strong> має право завантажувати на комп’ютери Користувачів файли cookie (якщо Користувач самостійно не обмежив дану можливість у своєму веб-браузері), а також одержувати, зберігати, обробляти й використовувати інформацію, створювану за допомогою cookie.</li>
          <li>При використанні Користувачем Сайту й послуг, обладнання <strong>CASE MANAGER PRO</strong> автоматично зберігає, обробляє й використовує дані Користувача, які не належать до Персональних, наприклад: IP-Адреса Користувача, дані про місцезнаходження Користувача, які можна визначити за допомогою його IP-Адреси, технічні параметри комп’ютера Користувача, наявність або відсутність у комп’ютері Користувача конкретного програмного забезпечення, налаштування даного програмного забезпечення, файли cookie, а також статистична інформація про активність Користувача.</li>
          <li><strong>CASE MANAGER PRO</strong> має право зберігати Персональні й інші дані Користувача стільки, скільки необхідно для реалізації мети, яка зазначена в даній Угоді, або в строки, встановлені чинним законодавством країни <strong>CASE MANAGER PRO</strong>, міжнародним законодавством, або країни Користувача, або до моменту видалення Користувачем цих даних.</li>
        </ol>

        <h2>3. ДОСТУП ДО ІНФОРМАЦІЇ</h2>
        <ol>
          <li><strong>CASE MANAGER PRO</strong> зобов’язується не надавати Персональні дані третім особам у комерційних цілях без згоди Користувача, до якого відносяться ці дані. Передача Персональних даних третім особам допускається в наступних випадках:
            <ul>
              <li>після одержання згоди Користувача, до якого належить дана інформація;</li>
              <li>по обґрунтованим запитам державних органів, які мають право одержувати такі дані;</li>
              <li>у тому випадку, якщо, на думку <strong>CASE MANAGER PRO</strong>, Користувач порушує умови даної Угоди й/або інших договорів і угод між <strong>CASE MANAGER PRO</strong> і Користувачем.</li>
            </ul>
          </li>
          <li>Користувач дозволяє <strong>CASE MANAGER PRO</strong> дозволяти іншим компаніям, з якими <strong>CASE MANAGER PRO</strong> уклав відповідні угоди, одержувати, зберігати й обробляти дані про Користувача (крім Персональних даних та Інформаційних матеріалів), такі як IP-Адреса Користувача, файли cookie, а також статистична інформація про активність Користувача для поліпшення якості надаваних цими компаніями послуг і інформації рекламного характеру.</li>
          <li>Користувач погоджується з тим, що конфіденційність переданих через Інтернет даних не гарантована й у випадку, якщо доступ до цих даних отриманий третіми особами поза зоною технічних засобів зв’язку, підвладних <strong>CASE MANAGER PRO</strong>, <strong>CASE MANAGER PRO</strong> не несе відповідальності за збиток, нанесений таким доступом. Використання Користувачем протоколу HTTPS (якщо така функція передбачена Тарифним планом Користувача) підвищує безпеку передачі даних в мережі Інтернет.</li>
          <li>Користувач має право запросити, змінити або вилучити свої Персональні дані, які знаходяться в <strong>CASE MANAGER PRO</strong>. Користувач може самостійно змінити або видалити свої Персональні дані використовуючи відповідні функції Сайту та свій обліковий запис. Якщо це не є можливим, Користувачу необхідно заявити відповідну вимогу, направивши її на контактну адресу <strong>CASE MANAGER PRO</strong>, зазначену на Сайті.</li>
          <li>У випадку, якщо при використанні Сайту Користувачеві будь-яким чином стала відома інформація відносно <strong>CASE MANAGER PRO</strong> і/або третіх осіб, яка згідно із законодавством України відноситься до конфіденційної й/або до Комерційної таємниці, Користувачу заборонено зберігати, використовувати й поширювати таку інформацію.</li>
          <li>Доступ до облікового запису (аккаунту) і даних, що зберігаються в обліковому записі Користувача, здійснюється з використанням відповідного логіна й пароля. У випадку, якщо сервіси Сайту, доступні Користувачеві, дозволяють зробити загальнодоступною яку-небудь інформацію Користувача, Користувач самостійно й під свою власну відповідальність активує й використовує дані функції Сайту й сервісів.</li>
          <li>З метою реалізації прав Користувачів та якісного виконання <strong>CASE MANAGER PRO</strong> своїх зобов’язань, передбачених угодами між Користувачем і <strong>CASE MANAGER PRO</strong>, <strong>CASE MANAGER PRO</strong> може ознайомлюватися з інформацією, що міститься в облікових записах (своєчасне вирішення технічних проблем, припинення незаконних дій, що порушують права користувачів і/або <strong>CASE MANAGER PRO</strong> і т.д.).</li>
        </ol>

        <h2>4. ДОДАТКОВІ УМОВИ</h2>
        <ol>
          <li><strong>CASE MANAGER PRO</strong> має право вносити зміни в дану Угоду. У випадку внесення в Угоду істотних змін, <strong>CASE MANAGER PRO</strong> додатково повідомить Користувача про ці зміни по електронній пошті. Усі зміни Угоди набувають чинності з моменту їх публікації. Використовуючи послуги або Сайт Користувач підтверджує свою згоду з новими умовами Угоди в редакції, яка діє на момент використання Користувачем послуг або Сайту.</li>
          <li><strong>CASE MANAGER PRO</strong> не несе відповідальності за шкоду або збитки, які зазнав Користувач або треті особи в результаті помилкового розуміння або нерозуміння умов даної Угоди, інструкцій або вказівок про порядок використання Сайту, щодо порядку розміщення і використання інформаційних даних і інших технічних питань.</li>
          <li>У випадку визнання недійсної або нездійсненної будь-якої частини даної Угоди, інші частини Угоди будуть залишатися в силі. Відмова кожної зі Сторін від будь-якого положення або умови даної Угоди, або будь-яке їхнє порушення не скасовує дію цього положення або умови.</li>
          <li>До даної Угоди й відносин між <strong>CASE MANAGER PRO</strong> і Користувачем, застосовується законодавство України. Кожна сторона повністю погоджується з тим, що відповідні суди України мають виняткову юрисдикцію щодо будь-яких претензій і суперечок, які стосуються Угоди.</li>
        </ol>
      </section>

    </div>
  )
}

export default Terms